本文集是笔者总结大学课程而创建的，笔者就读于广州华南理工大学信息工程专业，平时对专业课程和大学生活有些记录和思考，写下总结帖供后来人参考，由于笔者视野有限，如有错误请多多指教。也邀请学院内同样有兴趣写点想法的朋友，参与创建本文集，欢迎私信联系

------------

##### 创作过程
从大二以来，笔者就有总结码字的习惯，留有一些文档和资料供后来人参考，但到17年3月份才着手搬移到简书上。一方面，笔者希望将想法直接分享给更多的人，有更多的沟通，所以搬到网络平台上；另一方面，简书支持markdown风格、移动PC端同步，赞赏留言等，对创作十分有利。笔者在尝试完更新大三上总结后，准备陆续更新其余学期的总结，不幸开始忙于各类事务，**压力空前，暂时搁置原来的计划（仍会偶尔更新）**，不过对请教的问题会尽快回答~
> 码好一篇文章花费的时间大概在3-5小时，忙碌起来创作不易

------------
##### 我眼中的大学
大学以来，笔者一直都在认真思考学校好坏、本科教育、专业前景等问题，内心的想法在不断变化，曾经有过激进、功利，狭隘的想法，随着阅历的丰富，最后觉得应该从朴素的想法出发：本科教育培养基础素养，工作能力要求工程技术，读研老师大部分偏向科研少数偏工程，自己有各方面的追求、兴趣和野心，这些都是相互促进又大不相同的，应该从实际出发平衡位置......

------------
##### 联系方式
如果有什么疑问或者建议，欢迎留言、私信，对于深入探讨的问题请发送至邮箱：*li.xin.peng@qq.com*
**待更正和补充......**
